#+title:
#+author: Joseph Irwin
#+property: header-args :noweb yes

*** Linear Classifier 2

Features: p, P_1s, P_3s

|    0 | constraints.default   | 1119.1 | 13316958817 | 10768961378 | 83.79 |  5 |
|    0 | constraints.precision | 1245.7 | 13842288667 | 11657560320 | 84.68 |  2 |
|    0 | constraints.recall    | 1007.6 | 11964170969 |  7510974952 | 78.78 | 95 |
|    0 | constraints.maxprec   | 1389.8 | 15576369500 | 14842456458 | 85.72 |  0 |
|    0 | test.boundaries       | 1016.8 | 12164963359 |  8470948033 | 86.71 |  4 |
|   20 | constraints.default   | 1278.8 | 13854603558 | 11159762325 |  84.2 |  2 |
|   20 | constraints.precision | 1227.1 | 14330995855 | 12006728014 | 84.89 |  2 |
|   20 | constraints.recall    |  998.3 | 12561604126 |  7959701888 | 80.34 | 57 |
|   20 | constraints.maxprec   | 1439.6 | 15861950827 | 15036761915 | 85.78 |  0 |
|   20 | test.boundaries       | 1054.6 | 12756095006 |  8897890529 | 86.55 |  2 |
|   30 | constraints.default   | 1277.4 | 15111663336 | 12704523363 | 84.86 |  0 |
|   30 | constraints.precision | 1307.1 | 15385507328 | 13310327353 | 85.19 |  0 |
|   30 | constraints.recall    | 1116.3 | 14107120181 |  9930495929 | 82.75 | 26 |
|   30 | constraints.maxprec   | 1476.1 | 16440202343 | 15747939325 | 85.75 |  0 |
|   30 | test.boundaries       | 1152.9 | 14252188350 | 10753841131 | 86.33 |  0 |
|   40 | constraints.default   | 1509.7 | 16381293071 | 15038933828 | 85.48 |  0 |
|   40 | constraints.precision | 1357.5 | 16494416016 | 15323478757 |  85.7 |  0 |
|   40 | constraints.recall    | 1404.5 | 15869684025 | 13345856748 | 84.86 |  8 |
|   40 | constraints.maxprec   | 1507.5 | 16971806883 | 16674505777 | 85.83 |  0 |
|   40 | test.boundaries       | 1344.4 | 15955429934 | 13931989846 | 86.04 |  0 |
| 1000 | constraints.default   | 1528.3 | 17247848869 | 17466541935 | 85.85 |  0 |
| 1000 | constraints.precision | 1501.3 | 17247848869 | 17466541935 | 85.85 |  0 |
| 1000 | constraints.recall    | 1503.5 | 17247848869 | 17466541935 | 85.85 |  0 |
| 1000 | constraints.maxprec   | 1550.9 | 17247848869 | 17466541935 | 85.85 |  0 |
| 1000 | test.boundaries       | 1292.9 | 17247848869 | 17466541935 | 85.85 |  0 |


| SentLen | Constraints   | time(s) |   #rules |     |   #edges |     |   F_1 |       | #failed |
|---------+---------------+---------+----------+-----+----------+-----+-------+-------+---------|
|       0 | default       |  1119.1 | 1.33e+10 |  77 | 1.08e+10 |  62 | 83.79 | -2.06 |       5 |
|       0 | precision     |  1245.7 | 1.38e+10 |  80 | 1.17e+10 |  67 | 84.68 | -1.17 |       2 |
|       0 | recall        |  1007.6 | 1.20e+10 |  70 | 7.51e+09 |  43 | 78.78 | -7.07 |      95 |
|       0 | max precision |  1389.8 | 1.56e+10 |  91 | 1.48e+10 |  85 | 85.72 | -0.13 |       0 |
|       0 | oracle        |  1016.8 | 1.22e+10 |  71 | 8.47e+09 |  48 | 86.71 |  0.86 |       4 |
|      20 | default       |  1278.8 | 1.39e+10 |  81 | 1.12e+10 |  64 |  84.2 | -1.65 |       2 |
|      20 | precision     |  1227.1 | 1.43e+10 |  83 | 1.20e+10 |  69 | 84.89 | -0.96 |       2 |
|      20 | recall        |   998.3 | 1.26e+10 |  73 | 7.96e+09 |  45 | 80.34 | -5.51 |      57 |
|      20 | max precision |  1439.6 | 1.59e+10 |  92 | 1.50e+10 |  86 | 85.78 | -0.07 |       0 |
|      20 | oracle        |  1054.6 | 1.28e+10 |  74 | 8.90e+09 |  51 | 86.55 |  0.70 |       2 |
|      30 | default       |  1277.4 | 1.51e+10 |  88 | 1.27e+10 |  73 | 84.86 | -0.99 |       0 |
|      30 | precision     |  1307.1 | 1.54e+10 |  90 | 1.33e+10 |  76 | 85.19 | -0.66 |       0 |
|      30 | recall        |  1116.3 | 1.41e+10 |  82 | 9.93e+09 |  57 | 82.75 | -3.10 |      26 |
|      30 | max precision |  1476.1 | 1.64e+10 |  95 | 1.57e+10 |  90 | 85.75 | -0.10 |       0 |
|      30 | oracle        |  1152.9 | 1.43e+10 |  83 | 1.08e+10 |  62 | 86.33 |  0.48 |       0 |
|      40 | default       |  1509.7 | 1.64e+10 |  95 | 1.50e+10 |  86 | 85.48 | -0.37 |       0 |
|      40 | precision     |  1357.5 | 1.65e+10 |  96 | 1.53e+10 |  87 |  85.7 | -0.15 |       0 |
|      40 | recall        |  1404.5 | 1.59e+10 |  92 | 1.33e+10 |  76 | 84.86 | -0.99 |       8 |
|      40 | max precision |  1507.5 | 1.70e+10 |  99 | 1.67e+10 |  95 | 85.83 | -0.02 |       0 |
|      40 | oracle        |  1344.4 | 1.60e+10 |  93 | 1.39e+10 |  79 | 86.04 |  0.19 |       0 |
|    1000 | default       |  1528.3 | 1.72e+10 | 100 | 1.75e+10 | 100 | 85.85 |  0.00 |       0 |
|    1000 | precision     |  1501.3 | 1.72e+10 | 100 | 1.75e+10 | 100 | 85.85 |  0.00 |       0 |
|    1000 | recall        |  1503.5 | 1.72e+10 | 100 | 1.75e+10 | 100 | 85.85 |  0.00 |       0 |
|    1000 | max precision |  1550.9 | 1.72e+10 | 100 | 1.75e+10 | 100 | 85.85 |  0.00 |       0 |
|    1000 | oracle        |  1292.9 | 1.72e+10 | 100 | 1.75e+10 | 100 | 85.85 |  0.00 |       0 |
#+TBLFM: $4=$0;%.2e::$5=$4*100/1.72e10;%.0f::$6=$0;%.2e::$7=$6*100/1.75e10;%.0f::$9=$8-85.85;p4%.2f

